In [22]:
import pandas as pd
import numpy as np

# 1.Question

In [138]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [139]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [140]:
df=df.replace({np.nan:[10055,10075]})

In [141]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [142]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 2.Question

In [143]:
df['From_To']=df['From_To'].apply(lambda x:x.split('_'))
df

               From_To  FlightNumber  RecentDelays              Airline
0      [LoNDon, paris]         10045      [23, 47]               KLM(!)
1      [MAdrid, miLAN]         10055            []    <Air France> (12)
2  [londON, StockhOlm]         10065  [24, 43, 87]  (British Airways. )
3    [Budapest, PaRis]         10075          [13]       12. Air France
4   [Brussels, londOn]         10085      [67, 32]          "Swiss Air"

# 3.question

In [144]:
df2=pd.DataFrame(df1['From_To'].to_list(),columns=['From','To'],index=[0,1,2,3,4])

In [145]:
df2['From']=df2['From'].apply(lambda x:x.lower().capitalize())
df2['To']=df2['To'].apply(lambda x:x.lower().capitalize())
df2

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# 4.question

In [148]:
df.drop('From_To',axis=1,inplace=True)

In [160]:
df=pd.concat([df2,df],axis=1)
df

,From,To,From,To,FlightNumber,RecentDelays,Airline
0,London,Paris,London,Paris,10045,"[23, 47]",KLM(!)
1,Madrid,Milan,Madrid,Milan,10055,[],<Air France> (12)
2,London,Stockholm,London,Stockholm,10065,"[24, 43, 87]",(British Airways. )
3,Budapest,Paris,Budapest,Paris,10075,[13],12. Air France
4,Brussels,London,Brussels,London,10085,"[67, 32]","""Swiss Air"""

# 5.Question

In [181]:
df3=pd.DataFrame(df['RecentDelays'].to_list(),columns=['delay_1','dealy_2','delay_3'])

In [189]:
df=pd.concat([df,df3],axis=1)

In [199]:
df.drop('RecentDelays',axis=1)

,From,To,From,To,FlightNumber,Airline,delay_1,dealy_2,delay_3
0,London,Paris,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN